https://www.kaggle.com/stormex/nba-web-scrape

In [2]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
import json

In [28]:
url = 'https://hoopshype.com/salaries/players/2018-2019/'

In [37]:
resp = requests.get(url)
resp.status_code

200

In [38]:
soup = BeautifulSoup(resp.content)

In [39]:
rows = soup.findAll('tr')

In [45]:
nm = []
new = []

In [46]:
for i in rows:
    nm.append(i.text.strip().replace('\t','').replace(',,',''))

In [47]:
for i in range(0,len(nm)):
    new.append(nm[i].replace('\n',',').split(',,'))

In [48]:
salary = pd.DataFrame(new[1:])

In [49]:
salary.head()

    0 1                  2             3            4
0  1.        Stephen Curry  ,$37,457,154  $38,074,629
1  2.    Russell Westbrook  ,$35,665,000  $36,252,932
2  3.           Chris Paul  ,$35,654,150  $36,241,903
3  3.         LeBron James  ,$35,654,150  $36,241,903
4  5.           Kyle Lowry  ,$32,700,000  $33,239,054

In [50]:
salary.drop([0,1,4],axis=1, inplace= True)

In [51]:
salary.head()

                   2             3
0      Stephen Curry  ,$37,457,154
1  Russell Westbrook  ,$35,665,000
2         Chris Paul  ,$35,654,150
3       LeBron James  ,$35,654,150
4         Kyle Lowry  ,$32,700,000

In [56]:
salary.rename({2:"name", 3:"salary"}, axis = "columns", inplace= True)

In [57]:
salary['salary'] = salary['salary'].str[1:]

In [58]:
salary.head()

                name       salary
0      Stephen Curry  $37,457,154
1  Russell Westbrook  $35,665,000
2         Chris Paul  $35,654,150
3       LeBron James  $35,654,150
4         Kyle Lowry  $32,700,000

In [59]:
len(salary)

576

In [64]:
salary.to_csv(r'/Users/juanmarin/IronHack/pipeline-proj/data/nbasalaries.csv', index = False)